<script setup>
import { reactive, ref } from 'vue';

const topicData = reactive({
  message: '话题分类',
  topicList: [
    {
      id: 1,
      topic: '学习模块',
      content: '考研不仅接送454564就覅就覅文件结尾考研不仅接送i金佛寺就覅就覅文件结尾考研不仅接送i金佛寺就覅就覅文件结尾考研不仅接送i金佛寺就覅就覅文件结尾考研不仅接送i金佛寺就覅就覅文件结尾考研不仅接送i金佛寺就覅就覅文件结尾考研不仅接送i金佛寺就覅就覅文件结尾考研不仅接送i金佛寺就覅就覅文件结尾考研不仅接送i金佛寺就覅就覅文件结尾'
    },
    {
      id: 2,
      topic: '文体活动',
      content: '考研不仅接送大454尾考研不仅接送i金佛寺就覅就覅文件结尾考研不仅接送i金佛寺就覅就覅文件结尾考研不仅接送i金佛寺就覅就覅文件结尾考研不仅接送i金佛寺就覅就覅文件结尾考研不仅接送i金佛寺就覅就覅文件结尾考研不仅接送i金佛寺就覅就覅文件结尾考研不仅接送i金佛寺就覅就覅文件结尾'
    }, {
      id: 3,
      topic: '文体活动',
      content: '考研不仅接送大454尾考研不仅接送i金佛寺就覅就覅文件结尾考研不仅接送i金佛寺就覅就覅文件结尾考研不仅接送i金佛寺就覅就覅文件结尾考研不仅接送i金佛寺就覅就覅文件结尾考研不仅接送i金佛寺就覅就覅文件结尾考研不仅接送i金佛寺就覅就覅文件结尾考研不仅接送i金佛寺就覅就覅文件结尾'
    }, {
      id: 4,
      topic: '文体活动',
      content: '考研不仅接送大454尾考研不仅接送i金佛寺就覅就覅文件结尾考研不仅接送i金佛寺就覅就覅文件结尾考研不仅接送i金佛寺就覅就覅文件结尾考研不仅接送i金佛寺就覅就覅文件结尾考研不仅接送i金佛寺就覅就覅文件结尾考研不仅接送i金佛寺就覅就覅文件结尾考研不仅接送i金佛寺就覅就覅文件结尾'
    }, {
      id: 5,
      topic: '文体活动',
      content: '考研不仅接送大454尾考研不仅接送i金佛寺就覅就覅文件结尾考研不仅接送i金佛寺就覅就覅文件结尾考研不仅接送i金佛寺就覅就覅文件结尾考研不仅接送i金佛寺就覅就覅文件结尾考研不仅接送i金佛寺就覅就覅文件结尾考研不仅接送i金佛寺就覅就覅文件结尾考研不仅接送i金佛寺就覅就覅文件结尾'
    }, {
      id: 6,
      topic: '文体活动',
      content: '考研不仅接送大454尾考研不仅接送i金佛寺就覅就覅文件结尾考研不仅接送i金佛寺就覅就覅文件结尾考研不仅接送i金佛寺就覅就覅文件结尾考研不仅接送i金佛寺就覅就覅文件结尾考研不仅接送i金佛寺就覅就覅文件结尾考研不仅接送i金佛寺就覅就覅文件结尾考研不仅接送i金佛寺就覅就覅文件结尾'
    }
  ]
})
</script>

<template>
  <div class="topics">
    <category-card :message="topicData.message" :list="topicData.topicList" :ifNeed="true"></category-card>
  </div>

</template>

<style scoped lang="less">
.topics {
  overflow: hidden;
  height: 100%;
  background-color: #f0f1f5;
}
</style>